export const roRus = {
    first: 'Первый',
    PageNotFound: 'У нас нет такой страници... -CSM',
    PageNotFoundTips0: `Возможно...\n `,
    PageNotFoundTips1: ` # Вы ввели неправильный адрес? Проверьте его дважды! `,
    PageNotFoundTips2: ` # Содержимое, к которому вы хотите получить доступ, в настоящее время находится в процессе обслуживания.`,
    second: {
        first: 'Первый второго',
    },

    privacy: {
        info: 'По функции LocalStorage и Cookie мы узнаем ваши настройки конфиденциальности. И никогда мы не отслеживайте ни вашего индивидуального рекламного идентификатора ни всех остальных, что связано с вашей важной конфиденциальностью.',
        warning: `
            <span class="font-semibold text-amber-500 text-lg lg:text-2xl">ВНИМАНИЕ</span>
            ：Этот сайт является сайтом
            <span class="font-semibold">【варианта минимального】</span> 
            доступ к 
            <a class="text-blue-400 mx-0.5 hover:text-blue-500 active:text-blue-700 transition no-underline hover:underline active:underline" href="https://corona.studio">https://corona.studio</a> 
            чтобы получить опыт полнофункциональный.`,
        okay: 'Знаю, не повтори...',
    },
    //
    base: {
        gotoMainSite: 'Дом',
        cs: '日冕工作室',
        mtfkne: '~',
        errVerGet:
            'Не удалось выполнить синхронизацию, и своевременность информации не может быть гарантирована.Пожалуйста, проверьте сеть и попробуйте принудительно обновить.',
        lowVer: 'Новая версия сайта, Удалите кэш, или Клик "обновить" ниже в Footer, чтобы обновить сайт. Старый сайт не могут есть своевременность их содержания.',
        clearCacheHint:
            'пробовал обновление. Удалите кэш, если обновление не работает.',
        none: 'без...',
        nolink: 'Ссылки нет',
        ok: 'Да',
        cancel: 'Нет',
        okay: 'Ладно',
        period: '.',
        decimal: ',',
        status: 'сост.',
        location: 'локация',
        contact: 'связь',
        copied: 'Скопировал',
        force: 'обновить',
        tips: 'подсказки',
        backview: 'обратимые',
        modalBugTips:
            'Потребитель Safari: обновите стр. если не можете выкл. модал.',
        heightFix: '修复高度',
        kb: 'КБCS',
    },

    tips: {
        contactsPage: 'Давай с нами пожертвовать!',
    },

    contacts: {
        pageTitle: 'Контакты',
        mainDescriptionHTML: `Здесь информации и контакты наши на общедоступных платформах. Больше создали нас.`,
        more: '...',
    },

    jump: {
        jumpTitle: 'НАПРАВЛЕНИЕ',
        jumpingTo: 'Сейчас перенаправить к: ',
        hint: 'Внимание: Если дестинация нет из Corona.Studio, мы не можем гарантировать безопасности. Пожалуйста берегите себя.',
    },

    index: {
        welcome: 'Пожаловаем в',
        welcomeTail: 'сайт(min)',

        slogan: 'Созданный восхищением', //
        intro: 'О нас',

        minTitle: 'HOME-CoronaStudio.min',
    },

    contactInfo: {
        toOffical: 'К официальному',
        contactUs: 'Свяжитесь с нами!',
        bilibili: 'Bilibili: llr老腊肉',
        kook: 'KOOK: Corona Studio',
        coolapk: 'Coolapk: CoronaStudio',
        qqLauncherX: 'QGroup-LauncherX',
        qqProjBobcat: 'QGroup-ProjBobcat',
        qqCMFS: 'QGroup-CMFS',
        qqNewCheck: 'QGroup-Для Новычков',
    },

    about: {
        aboutCoronaStudio: 'Об...-CoronaStudio',
        aboutTips: '',
        aboutThisSite: 'О этом сайте',
        morePage1:
            'CSFront.min: Для клиентов, который без「WebAssembly」/ сеть「Слабая」: 「Progressive」、「Light」、「Responsive」&「Ограниченная」минимальный сайт.',
        morePage2:
            'Пожалуйста, обязательно посетите нас, если у вас есть возможность ',
        morePage3: ' чтобы получить полноценный опыт!',
        aboutUs: 'О Нас',
        intro1: 'Сначала состоящая из любителей ',
        intro2: '. Команда разработчиков。',
        intro3: 'Corona Studio（日冕工作室）является сторонним сервисом ',
        intro4:
            ' как к основному, создали группа профессионалов и энтузиастов, ' +
            '前身是CMFL启动器开发组，我们在此之前大部分时间都在维护 “快乐工艺服务器” 和 CMFL启动器 及其附属项目。 同时，我们在游戏服务器方面也有所涉猎。 网络上一些和我们志同道合或是有相同兴趣的朋友组成了我们最开始的团队。 现在由于项目规模以及后期计划等诸多因素。我们现在决定正式成立日冕工作室，并 ',
        intro5: '公开招募团队成员',
        intro6: '.',
        intro7: 'Узнать больше: ',
        intro8: 'принципы наши',
        intro9: 'Учёба вечная',
        intro10:
            '学习是无止境的。世界并非不可知，但是“路漫漫其修远兮，吾将上下而求索”——紧随不断前行的历史，我们希望永不落后。',
        intro11: 'Радно! PP',
        intro12: '吔！快乐吃饭、快乐睡觉、快乐学习是我们所期望的...',
        intro13: 'Быть строгим',
        intro14:
            '无论是为用户群众还是为我们自己，我们希望我们倾注心血的作品可以成为舒适的、美观的、实用的、有助于人的趁手工具。',

        partOfMembers: 'Часть из нас',
        partOfMembersHint: 'Полный список: ',

        m: {
            llr: 'организатор',
            leon: 'ключевой+пол-цик',
            eric: 'ключевой',
            fran: 'i18N&Front+Сайты',
            wht: 'сопровождающий+это сайт, i18N',
            jpz: 'COOP+i18N',
        },
    },

    cmf: {
        begin: 'Все сначала…',
        intro1: '—— CraftMineFun是我们的一切的起点: 从第一个MC游戏服务器CMF开始, 到面向这个服务器的启动器CMFL... ',
        intro2: '如今, 脱胎换骨自CMFL的下一代启动器',
        intro3: '已然问世, 曾经的游戏群组服',
        intro4: '已经以的全新姿态重新开放. ',
        joinCMFSServer: '加入CMFS系列服务器',
        linkIntro1: '点击',
        linkIntro2: '条目来复制，',
        linkIntro3: ' 条目来在新选项卡打开链接; 点击带有',
        linkIntro4: '角标的词语可前往解释。',
        statusIntro1: '状态具有以下值: ',
        statusIntro2: '- WIP: 仍然在开发中 ',
        statusIntro3: '- alpha: 正在限制测试中 ',
        statusIntro4: '- beta: 公开测试 ',
        statusIntro5: '- alive: 正式运营中的 ',
        statusIntro6: '- pause: 暂停或长期维护状态 ',
        statusIntro7: '- ending: 正在结束生命周期 ',
        statusIntro8: '- stop: 停止运营 ',
        cmfl: 'CMFL',
        cmflDetail: 'CMFL是LauncherX的“起源”。现在已经',
        cmflDetailEx: '停止维护',
        cmflTips:
            'CMFL是曾经为CMF群组服务器开发的启动器。它的后代LauncherX现已脱颖而出。',
        toLx: '了解LauncherX',
    },

    joinUs: {
        joinUs: 'присоединяйтесь к нам! -CoronaStudio.min',
        joindoc: 'вербовавший документ',
        icanclaim: 'Что могу получить?',
        whatweneed: 'Какой нужен?',
        howtojoin: 'Считай меня! А как?',
        others: 'Ещё...',

        info1: `
        <p class="mud-typography mud-typography-body1">
            首先，<b>权利与义务是对等的。</b>您若想享受加入后的权利，除了需要证明您有实力，
            也需要履行作为成员的义务，才可以享受作为成员的对应权利。
            <br><br>
            加入我们后，您可以:
        </p>
        <p class="mud-typography mud-typography-body1 mt-3">
            <b>如果您参与开发工作，您将会：</b>
            <br>
            - 获取源码控制的较高权限，按需访问团队在数年间积累下来的源代码和工具链。
            <br><br>
            - 有机会调用团队资源。
        </p>
        <p class="mud-typography mud-typography-body1 mt-3">
            <b>如果您参与游戏相关工作（如CMF群组服）、
            和开发的工作（如质量控制），您将能够：</b>
            <br>
            - 锻炼有关方面的能力，并积累实战经验。
        </p>
        <p class="mud-typography mud-typography-body1 mt-3">
            <b>不论如何，您都可以：</b>
            <br>
            -与组内菊苣深入交流，获得一些人生经验。
            <br><br>
            -扩展人脉关系。
            <br><br>
            -锻炼团队合作能力，提升团队合作意识。
            <br><br>
            -在Minecraft社区中拥有获得认可的头街。
        </p>
        `,
        info2: `
        <p class="mud-typography mud-typography-body1"> 
            ! define ВНО = "Включая, но не ограничиваясь этим" !
            <br>
            <b>Бро с своими проектами：</b>
            <br>
            我们欢迎任何人自带项目入群。如果您有一个想法却因没有人手或平台难以实现，那么加入我们吧！
            <br><br>
            <b>C#、WPF/AvaloniaUI dev：</b>
            <br>
            熟悉C#的各类语法，对WPF有比较深刻的理解。对设计模式、算法优化、HTTP请求方面有开发经验。
            <br><br>
            <b>Бэкэнд：</b>
            <br>
            Знаком с необходимыми навыками бэкэндов, ВНО: C#, NodeJS, синтаксис Typescript, MySQL/SQL Server, 
            и с знанием об dapr/k8s (GO/C#) лучше!
            <br><br>
            <b>Minecraft-сервер персонал：</b>
            <br>
            ВНО: Minecraft архитектор, инженер сопровождающий(опытный в работе с Linux(лучше: CommandLine) и Windows Server)
            <br><br>
            <b>RPG-сервер писатель：</b>
            <br>
            有比较丰富的想象力，能够做到自己描述出比較完整的剧情线。
            <br><br>
            <b>i18N：</b>
            <br>
            掌握至少两门外语，具备一定的翻译能力，与适配目标地区保持或存在过一定的交流。
            <br><br>
            <b>C++(!)：</b>
            <br>
            熟悉C++的各种语法，并且在算法优化方面有一定的经验。
            <br><br>
            <b>Тестировщик：</b>
            <br>
            包括但不限于 Minecraft服务器的测试和启动器及其他项目的质量控制。
            <br><br>
            <b>Гражданский персонал：</b>
            <br>
            ВНО: литература реклама / юридические вопросы.
            <br><br>
            <b>художник：</b>
            <br>
            ВНО: Художник постер, дизайн UI и CG, Minecraft Texture/Skin рисователь.
            <br><br>
            <b>Талисман：</b>
            <br>
            Начните с нуля. И пожалуйста научитесь чему-нибудь, чтобы стать 
            <br><br>
            <i>нам не требуется практический опыт ни в каком аспекте: Один из наших принципалов является "учёба вечная", 
            и Corona Studio - это также платформа для практики.</i>
        </p>
        `,
        info3: `
        <p class="mud-typography mud-typography-body1">
            <b>Рад слышать, что вы уверены в том, что будете развиваться вместе с нами! <br>Что дальше, так это:</b>
            <br><br>
            - Присоединяйтесь к групповому чату QQ* <b>1040526762</b> и дайте нам знать, чем вы предпочитаете заниматься.<br>
            - Продемонстрируйте свои способности в соответствии с <b>правилами в документах в ГЧ</b> и ответьте на вопросы рецензентов<br>
            - Дождитесь, пока участники обсудят и уведомят вас...<br>
            - И это всё! ETA：20Мин +-<br>
            * ЕСЛИ ВЫ НЕ ЗНАЕТЕ КАК ПРИСОЕДИНЯЙТЕСЬ К ГРУППОВОМУ ЧАТУ QQ, свяжитесь с ВК@frigdec и опишите. <br>
            <i>
            （Управление внутренним персоналом может занять больше времени, 
            в зависимости от того, сейчас дневное время по западному времени 
            США или дневное время по пекинскому времени, и находится ли нет laolarou в своем родном городе.）
            </i>
        </p>
        `,
        info4: `
        <p class="mud-typography mud-typography-body1">
            Другие материалы, которые, возможно, вас заинтересуют...
            <br>
            <br>
            Q：Подвергнусь ли я дискриминации по признаку пола или возраста?
            <br>
            <b>A：Конечно нет! Мы надеемся создать группу включающую позитивную и активную,
            и у нас не таких пределов.</b>
            <br>
            <br>
            Q：Работа рентабельная?
            <br>
            <b>A：Если проект вы работаете рентабельный, вы получите долю в зависимости от вашего вклада.</b>
            <br>
            <br>
            Q：Если я надо пауза для учёб (ЕГЭ, ВУЗ) и не могу работать за группы, будете ли выгнать меня?
            <br>
            <b>
                A：Конечно нет! Один из наших принципалов является "учёба вечная".
                И знания что самые важные, может быть из школ. Если вы надо сделать паузу для своё обучения,
                Мы будем ждать вам за год (макс. 4 года, дайте нам знать раз в год. ).
                Если вы не вернулись после промежуток времени который мы узнаем, возможно 
                вас следует пересмотреть за ваше возвращение.
                Внимание, во время у вас пауза, мы позволим другим людям выполнять вашу работу 
                (за исключением: проектов под вашим руководством)
                пока вы не вернетесь.
            </b>
        </p>
        `,
    },

    LauncherX: {
        intro: 'Великий и Красивый Minecraft Launcher<br> -- с Ядром с Открытым Исходным Кодом:',
        nowDownload: 'скачать',
        downIntro1:
            'Файлы скачанные здесь не будут обновлять свои с автоматическим конструктором (CI). ',
        downIntro2: 'Зайдите на главный сайт',
        downIntro3:
            ', чтобы загрузить новейшую версию;<br> или загрузить лаунчер здесь и использовать встроенное обновление.',
        downIntro4: '',
        downIntro5: ' ',
        knowLauncherX: 'Узнать больше о LauncherX',
        cskbButton: 'CSKB',
        mainIntro: 'главсайт',
        advert: 'MineBBS',
        advertLink: '',
    },

    footer: {
        rightTask:
            'Corona Studio оставляет за собой право интерпретировать весь предоставленный ею контент.',
        icp1: 'ICP -',
        icp2: 'SCPIS -',
        reportToCNGov: 'сообщать о незаконной и мусорной информации(КНР)',
        tips1: 'Если есть ошибка отображения, Пожалуйста, попробуйте обновить или отрегулировать размер окна / <br>изменить ориентацию экрана / включить складной экран / не пользуйтесь часами / <br>переходите на устройство большего размера，или: [',
        tips2: 'ТАП ЗДЕСЬ',
        tips3: ']。',
    },

    Navbar: {
        more: 'Ещё',
        navi: 'Навигация',
    },

    pbc: {
        // pt: '',
        info1: 'Открытый, полнофункциональный ',
        info2: ' ядро лаунчера Minecraft, основанный на C#',
        sub: '『У нашего проекта рыжая кошка а у другого нет.』',
        toosmall:
            'Просмотр Badges по горизонтали или на более крупном устройстве',
    },

    helpblock: {
        titleblock: 'Нужна помощь?',
        titleTip: 'Посмотри эти ссылки!',
        related: 'связанный',
        toMainTitle: 'Эта страница на MAIN',
        contactTitle: ' Контакт: ',
        unsetyet:
            'жаль！Похоже, что администратор не установил соответствующую MAIN ссылку для этой страницы.',
    },

    // below are flexes
};
